// Домашнє завдання
// ---1---
// Перепишіть функцію, використовуючи '?' або '||'

// function checkAge(age) {
//   return age > 18 ? true : confirm('Батьки дозволили?');
// }
// checkAge(10);
// ---2---
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.

// const min = (a, b) => (a < b ? a : b);

// console.log(min(2, 25)); // 2
// ---3---
// Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:

// const ask = (question, yes, no) => {
//   if (confirm(question)) {
//     yes();
//   } else {
//     no();
//   }
// };
// ask(
//   'Ви згодні?',
//   function () {
//     alert('Ви погодились.');
//   },
//   function () {
//     alert('Ви скасували виконання.');
//   },
// );
